time = input("Введите время в формате hh:mm: ")

res = time.split(":") 
h = int(res[0]) 
min = int(res[1])
print (f'h={h}; min={min}')
h_dict = { 
    0: "двенадцать",
    1: "один",
    2: "два",
    3: "три",
    4: "четыре",
    5: "пять",
    6: "шесть",
    7: "семь",
    8: "восемь",
    9: "девять",
    10: "десять",
    11: "одиннадцать",
    12: "двенадцать",
    13: "один",
    14: "два",
    15: "три",
    16: "четыре",
    17: "пять",
    18: "шесть",
    19: "семь",
    20: "восемь",
    21: "девять",
    22: "десять",
    23: "одиннадцать"
    }
h_not_even_dict = {
    0: "двенадцатого",
    1: "первого",
    2: "второго",
    3: "третьего",
    4: "четвёртого",
    5: "пятого",
    6: "шестого",
    7: "седьмого",
    8: "восьмого",
    9: "девятого",
    10: "десятого",
    11: "одиннадцатого",
    12: "двенадцатого",
    13: "первого",
    14: "второго",
    15: "третьего",
    16: "четвёртого",
    17: "пятого",
    18: "шестого",
    29: "седьмого",
    20: "восьмого",
    21: "девятого",
    22: "десятого",
    23: "одиннадцатого",
    }
m_dict = {
     1: "одна",
    13: "тринадцать",
    14: "четырнадцать",
    15: "пятнадцать",
    16: "шестнадцать",
    17: "семнадцать",
    18: "восемнадцать",
    19: "девятнадцать",
    20: "двадцать",
    21: "двадцать одна",
    22: "двадцать два",
    23: "двадцать три",
    24: "двадцать четыре",
    25: "двадцать пять",
    26: "двадцать шесть",
    27: "двадцать семь",
    28: "двадцать восемь",
    29: "двадцать девять",
    30: "тридцать",
    31: "тридцать одна",
    32: "тридцать два",
    33: "тридцать три",
    34: "тридцать четыре",
    35: "тридцать пять",
    36: "тридцать шесть",
    37: "тридцать семь",
    38: "тридцать восемь",
    39: "тридцать девять",
    40: "сорок",
    41: "сорок одна",
    42: "сорок два",
    43: "сорок три",
    44: "сорок четыре",
    45: "сорок пять",

    
}
min1_dict= {
    1: "одной",
    2: "двух",
    3: "трех",
    4: "четырех",
    5: "пяти",
    6: "шести",
    7: "семи",
    8: "восьми",
    9: "девяти",
    10: "десяти",
    11: "одинадцати",
    12: "двенадцати",
    13: "тринадцати",
    14: "четырнадцати",
    15: "пятнадцати",
    16:"шеснацати",
    17:"семнадцати",
    18:"восемнадцати",
    19:"девятнадцати",
    20:"двадцати",
}

min1= 60-min

if min == 0:   
    if h==1 or h==13: print (f'{time} - {h_dict[h]} час ровно')
    elif 1<h<5 or 13<h<17: print (f'{time} - {h_dict[h]} часа ровно')
    else: print(f'{time} - {h_dict[h]} часов ровно')
elif min==21 or min==31 or min==41: print (f'{time} - {m_dict[min]} минута {h_not_even_dict [h+1]}')
elif 1<min<5: print(f'{time} - {h_dict[min]} минуты {h_not_even_dict [h+1]}')
elif 4<min<13: print(f'{time} - {h_dict[min]} минут {h_not_even_dict [h+1]}')
elif 21<min<25 or 31<min<35 or 41<min<45: print (f'{time} - {m_dict[min]} минуты {h_not_even_dict [h+1]}') 
elif 12<min<30: print (f'{time} - {m_dict[min]} минут {h_not_even_dict [h+1]}')
elif min==30: print (f'{time} - половина {h_not_even_dict [h+1]}') 
elif 30<min<45: print (f'{time} - {m_dict[min]} минут {h_not_even_dict [h+1]}')
elif min==59:
     if h==12 or h==0: print (f'{time} - без {min1_dict[min1]} минуты час')
     else: print (f'{time} - без {min1_dict[min1]} минуты {h_dict [h+1]}') 
elif min>=45:
     if h==12 or h==0: print (f'{time} - без {min1_dict[min1]} минут час')     
     else: print (f'{time} - без {min1_dict[min1]} минут {h_dict [h+1]}')
else: print (f'{time} - {m_dict[min]} минута {h_not_even_dict [h+1]}')