while True:
    time = input("Введите время в формате hh:mm:\n")

    if len(time) != 5:
        print("Некорректная длина")
        continue

    if time.count(':') != 1:
        print(
            "Некорректное количество разделительных знаков ':', он должен быть один")
        continue

    if time[2] != ':':
        print("Разделительный знак ':' должен быть в середине")
        continue

    [h, m] = time.split(":")

    if not (h.isdigit() and m.isdigit()):
        print("Часы и минуты должны вводиться только числами")
        continue

    h = int(h)
    m = int(m)

    if h > 23 or m > 59:
        print("Слишком большое значение часов либо минут")
        continue

    break

dict_h = {
    1: ('один', 'первого'),
    2: ('два', 'второго'),
    3: ('три', 'третьего'),
    4: ('четыре', 'четвертого'),
    5: ('пять', 'пятого'),
    6: ('шесть', 'шестого'),
    7: ('семь', 'седьмого'),
    8: ('восемь', 'восьмого'),
    9: ('девять', 'девятого'),
    10: ('десять', 'десятого'),
    11: ('одиннадцать', 'одиннацотого'),
    12: ('двенадцать', 'двенадцатого')
}

dict_m = {
    1: ('одна', 'одной'),
    2: ('две', 'двух'),
    3: ('три', 'трех'),
    4: ('четыре', 'четырех'),
    5: ('пять', 'пяти'),
    6: ('шесть', 'шести'),
    7: ('семь', 'семи'),
    8: ('восемь', 'восьми'),
    9: ('девять', 'девяти'),
    10: ('десять', 'десяти'),
    11: ('одиннадцать', 'одиннадцати'),
    12: ('двенадцать', 'двенадцати'),
    13: ('тринадцать', 'тринадцати'),
    14: ('четырнадцать', 'четырнадцати'),
    15: ('пятнадцать', 'пятнадцати'),
    16: ('шестнадцать', 'шестнадцати'),
    17: ('семнадцать', 'семнадцати'),
    18: ('восемнадцать', 'восемнадцати'),
    19: ('девятнадцать', 'девятнадцати'),
    20: ('двадцать', 'двадцати'),
    30: ('тридцать', 'половина'),
    40: ('сорок', 'сорок')
}

if h >= 12:
    h1 = h-12
else:
    h1 = h

m1 = m % 10
m2 = m-m1
m3 = 60-m


if m == 0:

    if h == 0:
        print('полночь')
    elif h == 1 or h == 13:
        print(f'{dict_h.get(h)[0]} час ровно')
    elif h == 2 or h == 3 or h == 4:
        print(f'{dict_h.get(h)[0]} часа ровно')
    else:
        print(f'{dict_h.get(h)[0]} часов ровно')

elif m == 30:
    print(f'{dict_m.get(m)[1]} {dict_h.get(h1+1)[1]}')
elif m == 40:
    print(f'{dict_m.get(m)[1]} минут {dict_h.get(h1+1)[1]}')
elif m < 45:
    if m <= 20:
        print(f'{dict_m.get(m)[0]} минут {dict_h.get(h1+1)[1]}')
    elif m > 21 and m < 25 and m > 31 and m < 35 and m > 41 and m < 45:
        print(f'{dict_m.get(m2)[0]} {dict_m.get(m1)[0]} минуты {dict_h.get(h1+1)[1]}')
    elif m == 21 and m == 31 and m == 41:
        print(f'{dict_m.get(m2)[0]} {dict_m.get(m1)[0]} минута {dict_h.get(h1+1)[1]}')
    elif m >= 25:
        print(f'{dict_m.get(m2)[0]} {dict_m.get(m1)[0]} минут {dict_h.get(h1+1)[1]}')
elif m < 59 and m >= 45:
    print(f'без {dict_m.get(m3)[1]} минут {dict_h.get(h1+1)[0]}')
else:
    print(f'без {dict_m.get(m3)[1]} минуты {dict_h.get(h1+1)[0]}')
